In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel(r'C:\Users\srika\Documents\Python Scripts\data.xlsx')

In [3]:
df.head(n=10)

                Column1
0                  Jack
1          3,000.00 CAD
2        168,990.00 INR
3               PENDING
4  SENT ON AUG 17, 2020
5                  Jack
6            400.00 CAD
7         22,140.00 INR
8             DELIVERED
9  SENT ON JUL 22, 2020

In [4]:
df.tail()

                  Column1
120                  Jack
121            978.00 CAD
122         52,047.90 INR
123             DELIVERED
124  SENT ON APR 25, 2018

In [5]:
df2 = pd.DataFrame(columns=['Name','AmountCAD','AmountINR','Status','DateSent'])

In [6]:
df2.head()

Empty DataFrame
Columns: [Name, AmountCAD, AmountINR, Status, DateSent]
Index: []

In [7]:
# https://numpy.org/doc/stable/reference/generated/numpy.reshape.html
df3 = pd.DataFrame(np.reshape(df.values,(25,5)), columns=['Name','AmountCAD','AmountINR','Status','DateSent'])

In [8]:
df3.head()

   Name     AmountCAD       AmountINR     Status              DateSent
0  Jack  3,000.00 CAD  168,990.00 INR    PENDING  SENT ON AUG 17, 2020
1  Jack    400.00 CAD   22,140.00 INR  DELIVERED  SENT ON JUL 22, 2020
2  Jack  2,590.00 CAD  139,412.00 INR  DELIVERED  SENT ON APR 25, 2020
3  Jack    600.00 CAD   30,450.00 INR  DELIVERED  SENT ON MAR 18, 2020
4  Jack    500.00 CAD   27,040.00 INR  DELIVERED  SENT ON JAN 25, 2020

In [9]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.split.html
new  = df3['AmountCAD'].str.split(".", n = 1, expand = True) 
new2  = df3['AmountINR'].str.split(".", n = 1, expand = True)

In [10]:
df3['AmountCAD'] = new[0]
df3['AmountINR'] = new2[0]

In [11]:
df3.head()

   Name AmountCAD AmountINR     Status              DateSent
0  Jack     3,000   168,990    PENDING  SENT ON AUG 17, 2020
1  Jack       400    22,140  DELIVERED  SENT ON JUL 22, 2020
2  Jack     2,590   139,412  DELIVERED  SENT ON APR 25, 2020
3  Jack       600    30,450  DELIVERED  SENT ON MAR 18, 2020
4  Jack       500    27,040  DELIVERED  SENT ON JAN 25, 2020

In [12]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.replace.html
df3['AmountCAD'] = df3['AmountCAD'].str.replace(',', '').astype(int)
df3['AmountINR'] = df3['AmountINR'].str.replace(',', '').astype(int)

In [13]:
df3.head()

   Name  AmountCAD  AmountINR     Status              DateSent
0  Jack       3000     168990    PENDING  SENT ON AUG 17, 2020
1  Jack        400      22140  DELIVERED  SENT ON JUL 22, 2020
2  Jack       2590     139412  DELIVERED  SENT ON APR 25, 2020
3  Jack        600      30450  DELIVERED  SENT ON MAR 18, 2020
4  Jack        500      27040  DELIVERED  SENT ON JAN 25, 2020

In [14]:
df3.groupby(
   ['Name']
).agg(
    {
         'AmountCAD':sum,  
         'AmountINR':sum, 
         'Name': "count"
    }
)

      AmountCAD  AmountINR  Name
Name
Jack      34850    1874865    22
Jill       6916     359759     3

In [15]:
df3.agg(
    {
         'AmountCAD':sum,  
         'AmountINR':sum, 
         'Name': "count"
    }
)

AmountCAD      41766
AmountINR    2234624
Name              25
dtype: int64

In [16]:
new3  = df3['DateSent'].str.split("ON ", n = 1, expand = True)

In [17]:
df3['DateSent'] = new3[1]

In [18]:
df3.head()

   Name  AmountCAD  AmountINR     Status      DateSent
0  Jack       3000     168990    PENDING  AUG 17, 2020
1  Jack        400      22140  DELIVERED  JUL 22, 2020
2  Jack       2590     139412  DELIVERED  APR 25, 2020
3  Jack        600      30450  DELIVERED  MAR 18, 2020
4  Jack        500      27040  DELIVERED  JAN 25, 2020

In [19]:
df3.dtypes

Name         object
AmountCAD     int32
AmountINR     int32
Status       object
DateSent     object
dtype: object

In [20]:
new4 = df3['DateSent'].str.split(" ", n = 1, expand = True)

In [21]:
new5 = new4[1].str.split(",", n = 1, expand = True)

In [22]:
df3['Month'] = new4[0]

In [23]:
df3['Day'] = new5[0]

In [24]:
df3['Year'] = new5[1]

In [25]:
df3.head()

   Name  AmountCAD  AmountINR     Status      DateSent Month Day   Year
0  Jack       3000     168990    PENDING  AUG 17, 2020   AUG  17   2020
1  Jack        400      22140  DELIVERED  JUL 22, 2020   JUL  22   2020
2  Jack       2590     139412  DELIVERED  APR 25, 2020   APR  25   2020
3  Jack        600      30450  DELIVERED  MAR 18, 2020   MAR  18   2020
4  Jack        500      27040  DELIVERED  JAN 25, 2020   JAN  25   2020

In [27]:
d = {
            'JAN' : 1,
            'FEB' : 2,
            'MAR' : 3,
            'APR' : 4,
            'MAY' : 5,
            'JUN' : 6,
            'JUL' : 7,
            'AUG' : 8,
            'SEP' : 9, 
            'OCT' : 10,
            'NOV' : 11,
            'DEC' : 12
    }

In [28]:
df3.Month = df3.Month.map(d)

In [29]:
df3.head()

   Name  AmountCAD  AmountINR     Status      DateSent  Month Day   Year
0  Jack       3000     168990    PENDING  AUG 17, 2020      8  17   2020
1  Jack        400      22140  DELIVERED  JUL 22, 2020      7  22   2020
2  Jack       2590     139412  DELIVERED  APR 25, 2020      4  25   2020
3  Jack        600      30450  DELIVERED  MAR 18, 2020      3  18   2020
4  Jack        500      27040  DELIVERED  JAN 25, 2020      1  25   2020

In [30]:
df3['Date'] = pd.to_datetime(df3[['Year','Month','Day']])

In [31]:
df3.head()

,Name,AmountCAD,AmountINR,Status,DateSent,Month,Day,Year,Date
0,Jack,3000,168990,PENDING,"AUG 17, 2020",8,17,2020,2020-08-17
1,Jack,400,22140,DELIVERED,"JUL 22, 2020",7,22,2020,2020-07-22
2,Jack,2590,139412,DELIVERED,"APR 25, 2020",4,25,2020,2020-04-25
3,Jack,600,30450,DELIVERED,"MAR 18, 2020",3,18,2020,2020-03-18
4,Jack,500,27040,DELIVERED,"JAN 25, 2020",1,25,2020,2020-01-25